app/controllers/movies_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT 1  [["session_token", "gH8ngf2OCNpOVEVH8egYtQ=="]]
---
  def set_current_user
    @current_user ||= session[:session_token] && User.find_by_session_token(session[:session_token])