app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "asd"]]
---
  def create
    if User.find_by_user_id(login_params[:user_id]) != nil