app/controllers/users_controller.rb

  def create
    if User.find_by_user_id(user_params[:user_id]) != nil
      flash[:notice] = "Sorry, this user ID is already taken. Try again."
      redirect_to new_user_path
    else
      flash[:notice] = "Welcome #{user_params[:user_id]}. Your account has been created."
      User.create_user!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "test"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "asd"], ["email", "asd"], ["session_token", "gH8ngf2OCNpOVEVH8egYtQ=="], ["created_at", "2015-10-08 19:57:05.722941"], ["updated_at", "2015-10-08 19:57:05.722941"]]